import sqlite3 

conn = sqlite3.connect("Plastic shop database.db")
cursor = conn.cursor()

cursor.execute("""
CREATE TABLE IF NOT EXISTS المنتجات(
    ID INTEGER PRIMARY KEY AUTOINCREMENT,
    النوع TEXT NOT NULL,
    اسم_المنتج TEXT NOT NULL,
    السعر REAL NOT NULL
)        
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS الطلبات(
    ID INTEGER PRIMARY KEY AUTOINCREMENT,
    اسم_المنتج TEXT NOT NULL,
    السعر REAL NOT NULL,
    تاريخ_الطلب TIMESTAMP DEFAULT CURRENT_TIMESTAMP
)
""")

cursor.executemany("""
INSERT INTO المنتجات
(النوع, اسم_المنتج, السعر)
VALUES (?, ?, ?)
""", [
    
("شنط و كياس", "كيلو أبيض و أسود", 45),
("شنط و كياس", "كيلو شفاف", 85),
("شنط و كياس", "كيلو بيور أسود", 85),
("شنط و كياس", "كيلو زبالة", 55),

("كوبايات", "عمود قهوة", 20),
("كوبايات", "عمود شاي", 25),
("كوبايات", "عمود مياه صغير", 22),
("كوبايات", "عمود مياه وسط", 27),
("كوبايات", "عمود مياه كبير", 35),

("شاليموه", "شاليموه زيج زاج", 10),
("شاليموه", "شاليموه مانجة", 30),
("شاليموه", "شاليموه جركات", 20),
("شاليموه", "شاليموه عادي", 17),

("أطباق", "تمن فوم", 25),
("أطباق", "ربع فوم", 35),
("أطباق", "نص فوم", 45),
("أطباق", "كيلو فوم", 65),
("أطباق", "طبق جاتوه بلاستيك صغير", 2),
("أطباق", "طبق جاتوه بلاستيك كبير", 2.5),
("أطباق", "طبق جاتوه عيد ميلاد عادي", 1),
("أطباق", "طبق جاتوه عيد ميلاد مربع", 2),

("أدوات طعام", "مفرش سفرة", 30),
("أدوات طعام", "ورق زبدة", 10),
("أدوات طعام", "مفرش ألمونيا", 35),
("أدوات طعام", "شيش", 10),
("أدوات طعام", "جوانتي", 10),

("أطباق خاصة", "100 تمن فوم بلاستيك 530 جم", 62),
("أطباق خاصة", "100 ربع فوم بلاستيك 900 جم", 98)

])

conn.commit()
conn.close()